CHN-HYH/esp32-26-h/esp32Board_wifi/main/src/app_myhttpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "app_myhttpd.hpp"

#include <list>
#include "esp_http_server.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "app_mymdns.h"
#include "sdkconfig.h"

#include "yahboom_camera.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define TAG ""
#else
#include "esp_log.h"
static const char *TAG = "camera_httpd";
#endif

static QueueHandle_t xQueueFrameI = NULL;
static QueueHandle_t xQueueFrameO = NULL;
static bool gReturnFB = true;

static int8_t detection_enabled = 0;
static int8_t recognition_enabled = 0;
static int8_t is_enrolling = 0;

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
#define STREAM_JPEG_QUALITY 60
#define STREAM_SOURCE_WIDTH 320
#define STREAM_SOURCE_HEIGHT 240
#define STREAM_PREVIEW_WIDTH (STREAM_SOURCE_WIDTH / 2)
#define STREAM_PREVIEW_HEIGHT (STREAM_SOURCE_HEIGHT / 2)
#define STREAM_PREVIEW_BUFFER_SIZE (STREAM_PREVIEW_WIDTH * STREAM_PREVIEW_HEIGHT * 2)
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %lld.%06lld\r\nX-Frame-Age: %lld\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;
httpd_handle_t webserver = NULL;

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    if (!index)
    {
        j->len = 0;
    }
    if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    {
        return 0;
    }
    j->len += len;
    return len;
}

static bool downsample_rgb565_2x(const camera_fb_t *frame, uint8_t *preview_buf)
{
    if (!frame || !preview_buf || frame->format != PIXFORMAT_RGB565 ||
        frame->width != STREAM_SOURCE_WIDTH || frame->height != STREAM_SOURCE_HEIGHT)
    {
        return false;
    }

    const uint16_t *src = reinterpret_cast<const uint16_t *>(frame->buf);
    uint16_t *dst = reinterpret_cast<uint16_t *>(preview_buf);

    // 识别保留完整 QVGA 原图，只有网页预览隔行隔列缩小为 160x120。
    for (size_t y = 0; y < STREAM_PREVIEW_HEIGHT; ++y)
    {
        const uint16_t *src_row = src + (y * 2 * STREAM_SOURCE_WIDTH);
        uint16_t *dst_row = dst + (y * STREAM_PREVIEW_WIDTH);
        for (size_t x = 0; x < STREAM_PREVIEW_WIDTH; ++x)
        {
            dst_row[x] = src_row[x * 2];
        }
    }

    return true;
}

static esp_err_t capture_handler(httpd_req_t *req)
{
    camera_fb_t *frame = NULL;
    esp_err_t res = ESP_OK;

    if (xQueueReceive(xQueueFrameI, &frame, portMAX_DELAY))
    {
        httpd_resp_set_type(req, "image/jpeg");
        httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
        httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

        char ts[32];
        snprintf(ts, 32, "%lld.%06ld", frame->timestamp.tv_sec, frame->timestamp.tv_usec);
        httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

        // size_t fb_len = 0;
        if (frame->format == PIXFORMAT_JPEG)
        {
                // fb_len = frame->len;
            res = httpd_resp_send(req, (const char *)frame->buf, frame->len);
        }
        else
        {
            jpg_chunking_t jchunk = {req, 0};
            res = frame2jpg_cb(frame, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
            httpd_resp_send_chunk(req, NULL, 0);
            // fb_len = jchunk.len;
        }

        if (xQueueFrameO)
        {
            xQueueSend(xQueueFrameO, &frame, portMAX_DELAY);
        }
        else if (gReturnFB)
        {
            esp_camera_fb_return(frame);
        }
        else
        {
            free(frame);
        }
    }
    else
    {
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    return res;
}

static esp_err_t stream_handler(httpd_req_t *req)
{
    camera_fb_t *frame = NULL;
    struct timeval _timestamp;
    esp_err_t res = ESP_OK;
    size_t _jpg_buf_len = 0;
    uint8_t *_jpg_buf = NULL;
    char part_buf[192];
    uint8_t *preview_buf = static_cast<uint8_t *>(
        heap_caps_malloc(STREAM_PREVIEW_BUFFER_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));

    if (preview_buf)
    {
        ESP_LOGI(TAG, "Stream source %dx%d RGB565, preview %dx%d",
                 STREAM_SOURCE_WIDTH, STREAM_SOURCE_HEIGHT,
                 STREAM_PREVIEW_WIDTH, STREAM_PREVIEW_HEIGHT);
    }
    else
    {
        ESP_LOGW(TAG, "Preview buffer allocation failed, using source frame for JPEG");
    }

    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if (res != ESP_OK)
    {
        free(preview_buf);
        return res;
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    httpd_resp_set_hdr(req, "X-Framerate", "20");

    while (true)
    {
        if (xQueueReceive(xQueueFrameI, &frame, portMAX_DELAY))
        {
            _timestamp.tv_sec = frame->timestamp.tv_sec;
            _timestamp.tv_usec = frame->timestamp.tv_usec;

            if (frame->format == PIXFORMAT_JPEG)
            {
                _jpg_buf = frame->buf;
                _jpg_buf_len = frame->len;
            }
            else if (downsample_rgb565_2x(frame, preview_buf))
            {
                if (!fmt2jpg(preview_buf, STREAM_PREVIEW_BUFFER_SIZE,
                             STREAM_PREVIEW_WIDTH, STREAM_PREVIEW_HEIGHT,
                             PIXFORMAT_RGB565, STREAM_JPEG_QUALITY,
                             &_jpg_buf, &_jpg_buf_len))
                {
                    ESP_LOGE(TAG, "Preview JPEG compression failed");
                    res = ESP_FAIL;
                }
            }
            else if (!frame2jpg(frame, STREAM_JPEG_QUALITY, &_jpg_buf, &_jpg_buf_len))
            {
                ESP_LOGE(TAG, "JPEG compression failed");
                res = ESP_FAIL;
            }
        }
        else
        {
            res = ESP_FAIL;
        }

